In addition to `timeout_milliseconds`, for me the following fields are not stable:

* `cache_key_parameters`
* `cache_namespace`
* `content_handling`
* `integration_http_method`
* `passthrough_behavior`
* `request_parameters`
* `response_parameters`

Output from `terraform plan`:

```
  # aws_api_gateway_integration.data_options must be replaced
+/- resource "aws_api_gateway_integration" "data_options" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "52ff9280" -> (known after apply)
        connection_type         = "INTERNET"
      + content_handling        = "CONVERT_TO_TEXT"
        http_method             = "OPTIONS"
      ~ id                      = "agi-oza5nq8eqx-2n947p53tx-OPTIONS" -> (known after apply)
      - integration_http_method = "OPTIONS" -> null # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
        request_templates       = {
            "application/json" = "{statusCode:200}"
        }
        resource_id             = "2n947p53tx"
        rest_api_id             = "oza5nq8eqx"
      ~ timeout_milliseconds    = 0 -> 29000
        type                    = "MOCK"
    }

  # aws_api_gateway_integration_response.data_options will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "data_options" {
        http_method         = "OPTIONS"
        id                  = "agir-oza5nq8eqx-2n947p53tx-OPTIONS-200"
        resource_id         = "2n947p53tx"
      ~ response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token,X-Amz-User-Agent'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
        response_templates  = {
            "application/json" = <<~EOT
                #set($origin = $input.params("Origin"))
                #if($origin == "") #set($origin = $input.params("origin")) #end
                #if($origin.matches(".*")) #set($context.responseOverride.header.Access-Control-Allow-Origin = $origin) #end
            EOT
        }
        rest_api_id         = "oza5nq8eqx"
        status_code         = "200"
    }

  # aws_api_gateway_method_response.data_options will be updated in-place
  ~ resource "aws_api_gateway_method_response" "data_options" {
        http_method         = "OPTIONS"
        id                  = "agmr-oza5nq8eqx-2n947p53tx-OPTIONS-200"
        resource_id         = "2n947p53tx"
        response_models     = {}
      ~ response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
        rest_api_id         = "oza5nq8eqx"
        status_code         = "200"
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

Sample terraform code:
```
provider "aws" {
  access_key                  = "mock_access_key"
  region                      = "us-east-1"
  s3_force_path_style         = true
  secret_key                  = "mock_secret_key"
  skip_credentials_validation = true
  skip_metadata_api_check     = true
  skip_requesting_account_id  = true
  endpoints {
    apigateway     = "http://localhost:4566"
  }
}

resource "aws_api_gateway_rest_api" "foo_gateway" {
  name = "foo-gateway"
  description = "foo gateway"
  api_key_source = "HEADER"
  endpoint_configuration {
    types = ["EDGE"]
  }
}

resource "aws_api_gateway_resource" "data" {
  rest_api_id = aws_api_gateway_rest_api.foo_gateway.id
  parent_id = aws_api_gateway_rest_api.foo_gateway.root_resource_id
  path_part = "data"
}

resource "aws_api_gateway_method" "data_options" {
  rest_api_id = aws_api_gateway_rest_api.foo_gateway.id
  resource_id = aws_api_gateway_resource.data.id
  authorization = "NONE"
  http_method = "OPTIONS"
  request_parameters = {}
}

resource "aws_api_gateway_method_response" "data_options" {
  rest_api_id = aws_api_gateway_rest_api.foo_gateway.id
  resource_id = aws_api_gateway_resource.data.id
  http_method = aws_api_gateway_method.data_options.http_method
  status_code = "200"
  response_parameters = {
    "method.response.header.Access-Control-Allow-Origin": true,
    "method.response.header.Access-Control-Allow-Headers": true,
    "method.response.header.Access-Control-Allow-Methods": true
  }
  response_models = {}
}

resource "aws_api_gateway_integration" "data_options" {
  rest_api_id = aws_api_gateway_rest_api.foo_gateway.id
  resource_id = aws_api_gateway_resource.data.id
  http_method = aws_api_gateway_method.data_options.http_method
  type = "MOCK"
  request_templates = {
    "application/json": "{statusCode:200}"
  }
  content_handling = "CONVERT_TO_TEXT"
}

resource "aws_api_gateway_integration_response" "data_options" {
  rest_api_id = aws_api_gateway_rest_api.foo_gateway.id
  resource_id = aws_api_gateway_resource.data.id
  http_method = aws_api_gateway_method.data_options.http_method
  status_code = "200"
  response_parameters = {
    "method.response.header.Access-Control-Allow-Origin": "'*'",
    "method.response.header.Access-Control-Allow-Headers": "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token,X-Amz-User-Agent'",
    "method.response.header.Access-Control-Allow-Methods": "'OPTIONS,GET'"
  }
  response_templates = {
    "application/json": <<EOF
#set($origin = $input.params("Origin"))
#if($origin == "") #set($origin = $input.params("origin")) #end
#if($origin.matches(".*")) #set($context.responseOverride.header.Access-Control-Allow-Origin = $origin) #end
EOF
  }
  depends_on = [aws_api_gateway_integration.data_options]
}

resource "aws_api_gateway_deployment" "foo_gateway" {
  rest_api_id = aws_api_gateway_rest_api.foo_gateway.id
  depends_on = [aws_api_gateway_integration.data_options]
  stage_name = "bar"
  lifecycle {
    create_before_destroy = true
  }
}
```
